## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.bastion.azurerm_bastion_host.bastionhost will be updated in-place
  ~ resource "azurerm_bastion_host" "bastionhost" {
        id                        = "/subscriptions/1c7e8402-ac8b-48d9-a8c8-f3de95064482/resourceGroups/aztf-hub-rg/providers/Microsoft.Network/bastionHosts/aztf-hub-vnet-bastion"
        name                      = "aztf-hub-vnet-bastion"
      ~ tags                      = {
          - "Environment" = "Dev" -> null
          - "Owner"       = "kmiszel" -> null
          - "Source"      = "Terraform" -> null
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.bastion.azurerm_public_ip.bastionhost will be updated in-place
  ~ resource "azurerm_public_ip" "bastionhost" {
        id                      = "/subscriptions/1c7e8402-ac8b-48d9-a8c8-f3de95064482/resourceGroups/aztf-hub-rg/providers/Microsoft.Network/publicIPAddresses/aztf-hub-vnet-bastion-pip"
        name                    = "aztf-hub-vnet-bastion-pip"
      ~ tags                    = {
          - "Environment" = "Dev" -> null
          - "Owner"       = "kmiszel" -> null
          - "Source"      = "Terraform" -> null
        }
        # (12 unchanged attributes hidden)
    }

  # module.firewall.azurerm_firewall.firewall will be created
  + resource "azurerm_firewall" "firewall" {
      + dns_proxy_enabled   = (known after apply)
      + firewall_policy_id  = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "aztf-hub-vnet-firewall"
      + resource_group_name = "aztf-hub-rg"
      + sku_name            = "AZFW_VNet"
      + sku_tier            = "Standard"
      + threat_intel_mode   = "Deny"

      + ip_configuration {
          + name                 = "configuration"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = "/subscriptions/1c7e8402-ac8b-48d9-a8c8-f3de95064482/resourceGroups/aztf-hub-rg/providers/Microsoft.Network/publicIPAddresses/aztf-hub-vnet-firewall-pip"
          + subnet_id            = "/subscriptions/1c7e8402-ac8b-48d9-a8c8-f3de95064482/resourceGroups/aztf-hub-rg/providers/Microsoft.Network/virtualNetworks/aztf-hub-vnet/subnets/AzureFirewallSubnet"
        }

      + timeouts {
          + create = "60m"
          + delete = "60m"
          + update = "60m"
        }
    }

  # module.firewall.azurerm_public_ip.firewall will be updated in-place
  ~ resource "azurerm_public_ip" "firewall" {
        id                      = "/subscriptions/1c7e8402-ac8b-48d9-a8c8-f3de95064482/resourceGroups/aztf-hub-rg/providers/Microsoft.Network/publicIPAddresses/aztf-hub-vnet-firewall-pip"
        name                    = "aztf-hub-vnet-firewall-pip"
      ~ tags                    = {
          - "Environment" = "Dev" -> null
          - "Owner"       = "kmiszel" -> null
          - "Source"      = "Terraform" -> null
        }
        # (12 unchanged attributes hidden)
    }

  # module.firewall_rules.azurerm_firewall_policy.aks will be created
  + resource "azurerm_firewall_policy" "aks" {
      + child_policies           = (known after apply)
      + firewalls                = (known after apply)
      + id                       = (known after apply)
      + location                 = "northeurope"
      + name                     = "aks-fwp"
      + resource_group_name      = "aztf-hub-rg"
      + rule_collection_groups   = (known after apply)
      + sku                      = "Standard"
      + threat_intelligence_mode = "Alert"
    }

  # module.firewall_rules.azurerm_firewall_policy_rule_collection_group.AKS will be created
  + resource "azurerm_firewall_policy_rule_collection_group" "AKS" {
      + firewall_policy_id = (known after apply)
      + id                 = (known after apply)
      + name               = "aks-rcg"
      + priority           = 200

      + application_rule_collection {
          + action   = "Allow"
          + name     = "aks_app_rules"
          + priority = 205

          + rule {
              + destination_fqdn_tags = [
                  + "AzureKubnernetesService",
                ]
              + name                  = "aks_service"
              + source_addresses      = [
                  + "10.1.0.0/16",
                ]

              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
        }

      + network_rule_collection {
          + action   = "Allow"
          + name     = "aks_network_rules"
          + priority = 201

          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "443",
                ]
              + name                  = "https"
              + protocols             = [
                  + "TCP",
                ]
              + source_addresses      = [
                  + "10.1.0.0/16",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "53",
                ]
              + name                  = "dns"
              + protocols             = [
                  + "UDP",
                ]
              + source_addresses      = [
                  + "10.1.0.0/16",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "123",
                ]
              + name                  = "time"
              + protocols             = [
                  + "UDP",
                ]
              + source_addresses      = [
                  + "10.1.0.0/16",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "1194",
                ]
              + name                  = "tunnel_udp"
              + protocols             = [
                  + "UDP",
                ]
              + source_addresses      = [
                  + "10.1.0.0/16",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "9000",
                ]
              + name                  = "tunnel_tcp"
              + protocols             = [
                  + "TCP",
                ]
              + source_addresses      = [
                  + "10.1.0.0/16",
                ]
            }
        }
    }

Plan: 3 to add, 3 to change, 0 to destroy.
```
</details>